app/Models/AccountModel.php

SELECT *
FROM `user`
JOIN `role` ON `user`.`role_id` = `role`.`id`
WHERE `username` = 'c1c224b03cd9bc7b6a86d77f5dace40191766c485cd55dc48caf9ac873335d6f'
 LIMIT 1
---
    public function checkNickPass(string $nickname, string $password): array
    {

        $nicknameHash = hash('sha256', $nickname);

        $account = $this->table('user')->join("role", "user.role_id = role.id")->where('username', $nicknameHash)->first();