app/Models/ArticleModel.php

SELECT *
FROM `article`
ORDER BY `created_at` DESC
 LIMIT 6
---
    public function getLastArticles()
    {
        $query = $this->db->table('article')
            ->orderBy('created_at', 'DESC')
            ->limit(6)
            ->get();

SELECT *
FROM `article`
WHERE `article`.`crumb` = 'razzismo-e-salute-mentale'
---
    public function getArticle($crumb)
    {
        $result = $this->db->table('article')
            ->select('*')
            ->where('article.crumb', $crumb)
            ->get();

SELECT *
FROM `article`
JOIN `comment` ON `comment`.`article_crumb` = `article`.`crumb`
JOIN `user` ON `user`.`id` = `comment`.`user_id`
WHERE `article`.`crumb` = 'razzismo-e-salute-mentale'
ORDER BY `comment`.`created_at` DESC
---
    public function getAllCommentsFromArticle($crumb)
    {
        $query = $this->db->table('article')->join('comment', 'comment.article_crumb = article.crumb')->join('user', 'user.id = comment.user_id')->orderBy('comment.created_at', 'DESC')->where('article.crumb', $crumb)->get();