app/Models/VideoModel.php

    public function getVideo($value)
    {
        $result = $this->db->table('videos')->where('crumb', $value)->get();
---
SELECT *
FROM `videos`
WHERE `crumb` = 'arte-contro-il-razzismo'